import { Container } from '@/components/ui/container';

export default function Page() {
    // TODO: complete this page
    /* const sections = [
        {
            title: 'การก่อตั้ง Juniper Nexus',
            content:
                'Juniper Nexus ก่อตั้งขึ้นเมื่อ 5-6 เดือนที่แล้วโดยกลุ่มผู้เล่นที่มีความหลงใหลใน Garena RoV และความมุ่งมั่นในการสร้างกิลด์ที่ไม่เหมือนใคร เราเริ่มต้นจากกลุ่มเล็กๆ ที่มีความฝันใหญ่ในการเข้าร่วมแข่งขันระดับสูงและเป็นที่รู้จักในวงการอีสปอร์ต',
        },
        {
            title: 'การเดินทางของเรา',
            content:
                'ในช่วงเวลาที่ผ่านมา Juniper Nexus ได้เติบโตอย่างรวดเร็วและมีสมาชิกมากกว่า 100 คน เราภูมิใจที่ได้ก้าวขึ้นมาอยู่ในอันดับที่ 50 ของประเทศไทย ซึ่งเป็นผลจากความพยายามร่วมกันของสมาชิกทุกคน ความมุ่งมั่น และการทำงานเป็นทีม',
        },
        {
            title: 'วิสัยทัศน์ของเรา',
            content:
                'วิสัยทัศน์ของเราคือการเป็นกิลด์ที่โดดเด่นในระดับอีสปอร์ต และเป็นแหล่งรวมของนักเล่นที่มีฝีมือและความทุ่มเทสูงสุด เรามุ่งหวังที่จะสร้างสภาพแวดล้อมที่ท้าทายและเป็นกันเอง พร้อมกับนำเสนอกิจกรรมที่น่าตื่นเต้นและรางวัลที่ไม่เหมือนใครให้กับสมาชิกของเรา',
        },
    ]; */

    return (
        <>
            <section className="py-24">
                <Container className="container flex flex-col">
                    <h1>เกี่ยวกับ Juniper Nexus</h1>
                    <h2 className="text-muted-foreground">ประวัติของกิลด์</h2>
                </Container>
            </section>
        </>
    );
}
